Revit 2027 API
LabelUtils.GetLabelForBuiltInParameter(ForgeTypeId) Method
 Gets the user-visible name for a built-in parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelForBuiltInParameter(
	ForgeTypeId parameterTypeId
)
Public Shared Function GetLabelForBuiltInParameter (
	parameterTypeId As ForgeTypeId
) As String
public:
static String^ GetLabelForBuiltInParameter(
	ForgeTypeId^ parameterTypeId
)
static member GetLabelForBuiltInParameter :
        parameterTypeId : ForgeTypeId -> string
Parameters
parameterTypeId ForgeTypeId
 Identifier of the built-in parameter to get the user-visible name.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the built-in parameter cannot be found.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelForBuiltInParameter Overload
Autodesk.Revit.DB Namespace